#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПараметрыНастроекПоУмолчанию() Экспорт
	
	Возврат ПараметрыНастроек(Справочники.НастройкиПодключенияRabbitMQ.Основная);
	
КонецФункции

Функция ПараметрыНастроек(Настройка) Экспорт
	
	ПараметрыНастроек = Новый Структура;
	ПараметрыНастроек.Вставить("АдресСервера");
	ПараметрыНастроек.Вставить("Хост");
	ПараметрыНастроек.Вставить("Очередь");
	ПараметрыНастроек.Вставить("ИмяПользователя");
	ПараметрыНастроек.Вставить("Пароль");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НастройкиПодключенияRabbitMQ.АдресСервера КАК АдресСервера,
		|	НастройкиПодключенияRabbitMQ.Хост КАК Хост,
		|	НастройкиПодключенияRabbitMQ.Очередь КАК Очередь,
		|	НастройкиПодключенияRabbitMQ.ИмяПользователя КАК ИмяПользователя,
		|	НастройкиПодключенияRabbitMQ.Пароль КАК Пароль
		|ИЗ
		|	Справочник.НастройкиПодключенияRabbitMQ КАК НастройкиПодключенияRabbitMQ
		|ГДЕ
		|	НастройкиПодключенияRabbitMQ.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Настройка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыНастроек, Выборка)
	КонецЕсли;
	
	Возврат ПараметрыНастроек;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли
