
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтрокаБлюда = Блюда1.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000001");
	СтрокаБлюда.Количество = 1;
	СтрокаБлюда = Блюда1.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000002");
	СтрокаБлюда.Количество = 3;
	СтрокаБлюда = Блюда3.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000004");
	СтрокаБлюда.Количество = 1;
	
	СтрокаБлюда = Блюда2.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000003");
	СтрокаБлюда.Количество = 2;
	
	СтрокаБлюда = Блюда3.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000002");
	СтрокаБлюда.Количество = 2;
	СтрокаБлюда = Блюда3.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000004");
	СтрокаБлюда.Количество = 2;
	СтрокаБлюда = Блюда3.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000001");
	СтрокаБлюда.Количество = 1;
	
	СтрокаБлюда = Блюда4.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000002");
	СтрокаБлюда.Количество = 1;
	СтрокаБлюда = Блюда4.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000001");
	СтрокаБлюда.Количество = 1;
	
	СтрокаБлюда = Блюда5.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000004");
	СтрокаБлюда.Количество = 4;
	
	СтрокаБлюда = Блюда6.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000001");
	СтрокаБлюда.Количество = 2;
	СтрокаБлюда = Блюда6.Добавить();
	СтрокаБлюда.Блюдо = Справочники.Блюда.НайтиПоКоду("000000004");
	СтрокаБлюда.Количество = 4;
	
КонецПроцедуры
