
#Область ПрограммныйИнтерфейс

Процедура ОбработатьВходящееСообщение(ВходящееСообщение) Экспорт
	
	Перем Объект;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТелоJSON = КоннекторHTTP.JsonВОбъект(ВходящееСообщение.Тело,, Новый Структура("ПрочитатьВСоответствие", Ложь));
	
	Если ВходящееСообщение.Обменник = "statuses" Тогда
		ЗаказКлиента = Документы.ЗаказКлиента.НайтиПоИдентификатору(ТелоJSON.Ссылка);
		Объект = ЗаказКлиента;
		РегистрыСведений.СтатусыЗаказов.ОбновитьСтатусЗаказа(ЗаказКлиента, Перечисления.СтатусыЗаказовКлиентов[ТелоJSON.Статус]);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект) Тогда
		РегистрыСведений.СвязиОбъектовИСообщенийRMQ.СоздатьНовуюСвязь(Объект, ВходящееСообщение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьИсходящееСообщениеПоЗаказу(Заказ, ИсходящееСообщение) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РезультатОтправки = КоннекторRMQ.ОтправитьСообщениеВОчередь(ИсходящееСообщение);
	
	Если РезультатОтправки.Отправлено И РегистрыСведений.СтатусыЗаказов.АктуальныйСтатусЗаказа(Заказ) = Перечисления.СтатусыЗаказовКлиентов.Создан Тогда
		РегистрыСведений.СтатусыЗаказов.ОбновитьСтатусЗаказа(Заказ, Перечисления.СтатусыЗаказовКлиентов.Отправлен);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти