#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция СоздатьИсходящееСообщениеПоЗаказу(Заказ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееСообщение = Документы.ИсходящееСообщение.СоздатьДокумент();
	ИсходящееСообщение.Заполнить(Заказ);
	ИсходящееСообщение.ДополнительныеСвойства.Вставить("Объект", Заказ);
	ИсходящееСообщение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ИсходящееСообщение.Ссылка;
	
КонецФункции

Функция СоздатьИсходящееСообщениеПоБлюду(Блюдо) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ИсходящееСообщение = Документы.ИсходящееСообщение.СоздатьДокумент();
	ИсходящееСообщение.Заполнить(Блюдо);
	ИсходящееСообщение.ДополнительныеСвойства.Вставить("Объект", Блюдо);
	ИсходящееСообщение.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат ИсходящееСообщение.Ссылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
